test_cases/Wedge_Throttle_LES/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
     volScalarFieldValue y 0
 );
 
 regions
 (
     boxToCell
     {
         box (0.0004 0 -1) (1 1 1);
         fieldValues
         (
             volScalarFieldValue y 1
         );
     }
 );
 
 
// ************************************************************************* //
